{"Q":["NaOH", "Sodium hydroxide, also known as lye and caustic soda, is an inorganic compound with the formula NaOH. It is a white solid ionic compound consisting of sodium cations Na⁺ and hydroxide anions OH⁻ ", "CH4", "Methane is a chemical compound with the chemical formula CH₄. It is a group-14 hydride and the simplest alkane, and is the main constituent of natural gas.", "Cl2", "Chlorine is a chemical element with the symbol Cl and atomic number 17. The second-lightest of the halogens, it appears between fluorine and bromine in the periodic table and its properties are mostly intermediate between them. Chlorine is a yellow-green gas at room temperature.", "CCl4", "Carbon tetrachloride, also known by many other names is an organic compound with the chemical formula CCl₄. It is a colourless liquid with a sweet smell that can be detected at low levels. It is practically not flammable at lower temperatures", "HCl", "Hydrochloric acid, also known as muriatic acid, is an aqueous solution of hydrogen chloride. It is a colorless solution with a distinctive pungent smell. It is classified as a strong acid. It is a component of the gastric acid in the digestive systems of most animal species, including humans.","BaCl2", "Barium chloride is an inorganic compound with the formula BaCl₂. It is one of the most common water-soluble salts of barium. Like most other barium salts, it is white, toxic, and imparts a yellow-green coloration to a flame. It is also hygroscopic, converting first to the dihydrate BaCl₂(H₂O)₂", "(Al)2(SO4)3", "Al2(SO4)3 is a chemical compound with chemical name Aluminium sulfate. Aluminium sulfate is also called Filter Alum or Dialuminum trisulfate. ... The solution of aluminium sulfate is corrosive to aluminium. This compound is produced in the laboratory by adding aluminium hydroxide, to sulphuric acid", "BaSO4","Barium sulfate is the inorganic compound with the chemical formula BaSO₄. It is a white crystalline solid that is odorless and insoluble in water. It occurs as the mineral barite, which is the main commercial source of barium and materials prepared from it.", "AlCl3", "Aluminium chloride, also known as aluminium trichloride, describe compounds with the formula AlCl₃ₙ. They consist of aluminium and chlorine atoms in a 1:3 ratio, and one form also contains six waters of hydration. Both are white solids, but samples are often contaminated with iron(III) chloride, giving a yellow color.", "Na","Sodium is a chemical element with the symbol Na and atomic number 11. It is a soft, silvery-white, highly reactive metal. Sodium is an alkali metal, being in group 1 of the periodic table. Its only stable isotope is ²³Na. The free metal does not occur in nature, and must be prepared from compounds", "H2O", "Water is an inorganic, transparent, tasteless, odorless, and nearly colorless chemical substance, which is the main constituent of Earth's hydrosphere and the fluids of all known living organisms. It is vital for all known forms of life, even though it provides no calories or organic nutrients", "H2","Hydrogen: a chemical element with atomic number 1 and symbol H. It is a colorless, odorless, nonmetallic, tasteless, highly flammable diatomic gas with the molecular formula H2. It has an atomic mass of 1.00794.", "K","Potassium is a chemical element with the symbol K (from Neo-Latin kalium) and atomic number 19", "S","Sulfur (in British English: sulphur) is a chemical element with the symbol S and atomic number 16", "O2","Diatomic oxygen gas currently constitutes 20.95% of the Earth's atmosphere, though this has changed considerably over long periods of time. Oxygen makes up almost half of the Earth's crust in the form of oxides", "K2SO4","Potassium sulfate (US) or potassium sulphate (UK), also called sulphate of potash (SOP), arcanite, or archaically potash of sulfur, is the inorganic compound", "M2CO3","Potassium carbonate is the inorganic compound with the formula K2CO3. It is a white salt, which is soluble in water. It is deliquescent, often appearing as a .",  "CO2","The frozen solid form of CO2, known as dry ice is used as a refrigerant and as an abrasive in dry-ice blasting. It is a feedstock for the synthesis of fuels and chemicals. Carbon dioxide is the most significant long-lived greenhouse gas in Earth's atmosphere", "MHCO3","The most common magnesium carbonate forms are the anhydrous salt called magnesite (MgCO3) and the di, tri, and pentahydrates known as barringtonite (MgCO3·2 H2O), nesquehonite (MgCO3·3 H2O), and lansfordite (MgCO3·5 H2O), respectively" ]}

